{
    "projects": [
        {
            "title": "DatingApp",
            "slug": "dating-app",
            "type": 0,
            "category": "Dating App [Flutter, Django, Firebase]",
            "tags": [
                6,
                8
            ],
            "images": [
                "da1.jpg",
                "da2.jpg",
                "da3.jpg",
                "da4.jpg"
            ],
            "description": "Learning new technologies will always be fun I guess. With this project I was able to learn Python's Django framework and improve my skills with Flutter. But not only that - I think with this project there will be more benefit than just learning new things. It is a dating app made to connect people, whom might even be able to find their love there.. My plan is to release the app on Android and later iOS - the Alpha phase is starting very soon. The future of this project is still unknown so there are no public repositories at the moment. If you are interested in becoming a tester for the app use the contact form on this page to contact me. Stay tuned! ;)"
        },
        {
            "title": "X-Lights",
            "slug": "x-lights",
            "type": 0,
            "category": "Led Controller [Node, VueJS, C++/#]",
            "tags": [
                5,
                4,
                1,
                2,
                3
            ],
            "images": [
                "xl1.jpg",
                "xl2.jpg",
                "xl3.jpg"
            ],
            "video": "https://youtu.be/-3AohP7rNQk",
            "videoTeaser": "xl3.jpg",
            "description": "X-Lights is probably my largest programming project, it combines a variety of technologies to create an unique LED controller. Sound's simple, and to be honest, it is, but a lot of simplicity brings complexity. With X-Lights (to be renamed) you can control multiple LED strips all over the world. You can synchronize them, or let them all play their own unique show. X-Lights also supports sensors as inputs - you could use a light sensor to turn on your lights when it's dark, or let them glow red when your room has a certain temperature. As a programmer you can also easily create new light modes and extend existing functionality.<br><h4 class='project-overlay__content-description-sub-headline'>X-Lights consists of:</h4><ul class='project-overlay__content-description-list'><li class='project-overlay__content-description-list-item'>A NodeJS Server running a websocket</li><li class='project-overlay__content-description-list-item'>A Vue.js webapp to control the lights</li><li class='project-overlay__content-description-list-item'>A Wemos D1 Mini microcontroller</li><li class='project-overlay__content-description-list-item'>A small C# client that analyzes music</li></ul><br><br><a class='project-overlay__content-description-link' href='https://github.com/m-gebhard/x-lights-demo' target='_blank'>GitHub Demo Repo</a>"
        },
        {
            "title": "Spacepilot",
            "slug": "space-pilot",
            "type": 0,
            "category": "Android Game [Monogame]",
            "tags": [
                4
            ],
            "images": [
                "Spaceship.jpg"
            ],
            "description": "Spacepilot is a game for android smartphones. It's made with <a href='http://www.monogame.net/' target='_blank'>Monogame</a> for C#. You play as an pilot of a spaceship, and your objective is to destroy enemy fighters. Really simple, but highly addictive! Can you be the hero who saves the world from these evil guys? The project will be uploaded to my <a href='https://github.com/m-gebhard' target='_blank'>GitHub</a> account soon, stay tuned!"
        },
        {
            "title": "BetterKLM",
            "slug": "better-klm",
            "type": 0,
            "category": "Keyboard Light Manager [C#]",
            "tags": [
                4
            ],
            "images": [
                "betterklm1.jpg",
                "betterklm2.jpg"
            ],
            "description": "BetterKLM is a C# application made for controlling the led keyboard of the MSI GE60 Apache gaming laptop. The existing keyboard light manager misses some features I really wanted to have, so I built my own small application."
        },
        {
            "title": "Cherry Switch Breakout Board",
            "slug": "cherry-mx-board",
            "type": 1,
            "category": "Breakout Board [PCB, C++]",
            "tags": [
                5,
                7
            ],
            "images": [
                "ckm1.jpg",
                "ckm2.jpg",
                "ckm3.jpg"
            ],
            "description": "Learning new things is great, but it get's even better when learning is fun!<br>And that's why I decided to create this little Breakout Board for 2x3 Cherry switches, illuminated by the WS2812b led's on my way of learning PCB design. This board can be used with any microcontroller that has at least 7 digital pins and a 5V output. Each switch has an led above, all of them can be controlled separately. The board can be used as a mini keypad, a media controller (HID), or any other application that needs switches. For the first PCB project, I think it turned out very nice, what do you think? If you're interested, take a look at the schematics and maybe create something own with it?<br><br><a class='project-overlay__content-description-link' href='#' target='_blank'>Schematic + PCB (wip)</a><br><a class='project-overlay__content-description-link' href='https://github.com/m-gebhard/cherry-mx-keypad' target='_blank'>Media Controller Repo</a>",
            "video": "https://youtu.be/Aw7-uy8BW9g",
            "videoTeaser": "ckm2.jpg"
        },
        {
            "title": "Liquicalc",
            "slug": "liqui-calc",
            "type": 0,
            "category": "Liquid Calculator [Flutter]",
            "tags": [
                6
            ],
            "images": [
                "lq1.jpg",
                "lq2.jpg",
                "lq3.jpg"
            ],
            "description": "LiquiCalc was my first project that's realised in Flutter with Google's <a href='https://dart.dev/' target='_blank'>Dart</a> programming language. Flutter is a framework created to design Android and IOS apps easily. With LiquiCalc you can create awesome aroma recipes for your e-liquids! It includes a wide variety of pre-existing recipes, but you can also add your own ones. You're able to share created recipes with friends and the community. The project will be uploaded to my <a href='https://github.com/m-gebhard' target='_blank'>GitHub</a> account soon, stay tuned!"
        }
    ]
}
